cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'git'
cask '1password'
brew 'cask'
#brew 'hub'

brew 'ag'
cask 'alfred'
brew 'emacs', args: ['with-gnutls', 'without-librsvg', 'without-libxml2']
#cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'iterm2'
cask 'slack'
cask 'spectacle'
brew 'tree'
brew 'watch'
cask 'gitter'
#brew 'pick' # npm install -g ipt
brew 'zsh'

brew 'nodenv'
brew 'yarn'
#brew 'rbenv'
#brew 'ruby-build'
#cask 'java' unless system '/usr/libexec/java_home --failfast --version 9+ >/dev/null 2>&1'
#cask 'java8' unless system '/usr/libexec/java_home --failfast --version 1.8 >/dev/null 2>&1'
cask 'zulu8' unless system '/usr/libexec/java_home --failfast --version 8 >/dev/null 2>&1'
brew 'bower'
brew 'imagemagick'

cask 'jetbrains-toolbox'
cask 'docker'
cask 'visual-studio-code'

#cask 'provisionql'
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'qlprettypatch'
#cask 'qlstephen'
#cask 'quicklook-csv'
#cask 'quicklook-json'
