cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'git'
cask '1password'
brew 'cask'
#brew 'hub'

brew 'ag'
cask 'alfred'
brew 'emacs', args: ['with-gnutls', 'without-librsvg', 'without-libxml2']
#cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
#cask 'google-chrome'
cask 'iterm2'
#brew 'keybase'
#brew 'openssl'
cask 'slack'
cask 'spectacle'
brew 'tree'
brew 'watch'
cask 'gitter'
#brew 'mkdocs'
#cask 'pdfpen'
#brew 'pick' # npm install -g ipt

brew 'nodenv'
brew 'yarn'
#brew 'rbenv'
#brew 'ruby-build'
cask 'java' unless system '/usr/libexec/java_home --failfast >/dev/null 2>&1'
cask 'jce-unlimited-strength-policy'
#brew 'kafka'

#cask 'eclipse-java'
brew 'gradle'
#brew 'awscli'
#brew 'heroku-toolbelt'
#cask 'arduino'

#cask 'provisionql'
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'qlprettypatch'
#cask 'qlstephen'
#cask 'quicklook-csv'
#cask 'quicklook-json'
